package Java01;

// 문제 : 아래 코드가 실행되도록 해주세요.

public class Exam05 {
    public static void main(String[] args) {
        병사1 a병사 = new 병사1();
        a병사.이름 = "홍길동";

        a병사.자기소개();
        // 안녕하세요. 저는 홍길동 이병 입니다.
        a병사.공격();
        // 홍길동 이병이 공격합니다.(공격력 : 7)

        a병사.진급();

        a병사.자기소개();
        // 안녕하세요. 저는 홍길동 일병 입니다.
        a병사.공격();
        // 홍길동 일병이 공격합니다.(공격력 : 9)

        a병사.진급();

        a병사.자기소개();
        // 안녕하세요. 저는 홍길동 상병 입니다.
        a병사.공격();
        // 홍길동 상병이 공격합니다.(공격력 : 11)
    }
}

class 병사1{

    public static String 이름;
    int 계급번호=1;
    int 공격력=7;
    public void 자기소개() {
        System.out.println("안녕하세요. 저는 " + 이름 + 계급명() +"입니다.");
    }
    public void 공격() {
        System.out.println(이름 +" "+ 계급명() +"이 공격합니다.(공격력 : "+공격력+")");
    }
    public void 진급() {
        계급번호++;
        공격력=공격력+2;
    }
    String 계급명(){
        String 계급 ="";

        if (계급번호==1){
            계급="이병";
        }
        else if(계급번호==2){
            계급="일병";
        }
        else if(계급번호==3){
            계급="상병";
        }
        return 계급;
    }
}